app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      artist = Artist.find_by_id(params[:artist_id])
      if !artist
         flash[:alert] = "Artist not found"
         redirect_to(:artists)
      else
        @songs = artist.songs
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]

  def show
    @song = Song.find_by_id(params[:id])
    if params[:artist_id] && !@song
      artist = Artist.find(params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]